Repository: quarkusio/cn.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en
Languages: zh_cn

source: If the consumer method receives a `Message`, the acknowledgment strategy is `Strategy.MANUAL` and the consumer method is in charge of ack/nack the message.
zh_cn: 如果消费者方法接收到一个 `Message` ，那么确认策略是 `Strategy.MANUAL` 并且消费者方法将负责对消息进行ack/nack。

source: If the endpoint does not return a `CompletionStage`, the HTTP response may be written before the message is sent to Kafka, and so failures won't be reported to the user.
zh_cn: 如果节点没有返回 `CompletionStage` ，HTTP响应可能会返回在消息被发送到Kafka之前，因此失败不会被报告给用户。

source: If the message payload cannot be serialized to JSON, the message is _nacked_.
zh_cn: 如果消息的有效载荷不能被序列化为JSON，那么该消息是 _nacked_ 。

source: If the micro image does not suit your requirements, you can use https://catalog.redhat.com/software/containers/ubi8/ubi-minimal/5c359a62bed8bd75a2c3fba8[UBI- Minimal]. It's a bigger image, but contains more utilities and is closer to a full Linux distribution. Typically, it contains a package manager (`microdnf`), so you can install packages more easily.
zh_cn: 如果微镜像不符合你的要求，你可以使用 https://catalog.redhat.com/software/containers/ubi8/ubi-minimal/5c359a62bed8bd75a2c3fba8[UBI- Minimal]。这是一个更大的镜像，但包含了更多实用程序 且更接近于完整的 Linux 发行版。通常，它包含一个包管理器 (`microdnf`)，因此你可以利用它更方便地安装软件包。

source: If the outgoing record already contains a _key_, it *won't be overridden* by the incoming record key. If the incoming record does have a _null_ key, the `mp.messaging.outgoing.$channel.key` property is used.
zh_cn: 如果传出的记录已经包含一个 _键_，那么它 *不会* 被传入的记录键的键所覆盖。如果传入的记录键为_空_，那么 `mp.messaging.outgoing.$channel.key` 设置的值会被使用。

source: If the process cannot find the native image for some reason, or you want to test a native image that is no longer in the target directory you can specify the executable with the `-Dnative.image.path=` system property.
zh_cn: 如果进程由于某种原因找不到原生镜像，或者你想测试一个已经不在目标目录中的原生镜像，你可以用 `-Dnative.image.path=` 系统属性指定可执行文件。

source: If the processing completes successfully, _before committing the transaction_, the topic partition offsets of the given batch message will be committed to the transaction.
zh_cn: 如果处理成功完成，_在提交事务之前_ ，给定批处理消息的主题分区偏移量将提交给事务。

source: If the processing completes successfully, the producer is flushed and the transaction is committed.
zh_cn: 如果处理成功完成，则刷新生产者并提交事务。

source: If the processing needs to abort, _after aborting the transaction_, the consumer's position is reset to the last committed offset, effectively resuming the consumption from that offset. If no consumer offset has been committed to a topic-partition, the consumer's position is reset to the beginning of the topic-partition, _even if the offset reset policy is `latest`_.
zh_cn: 如果处理需要中止，_在中止事务后_ ，消费者的位置将重置为最后提交的偏移量，能有效地从该偏移量恢复消费。 如果没有消费者偏移量被提交到主题分区，消费者的位置将被重置到主题分区的开头，_即使把 `latest` 做为偏移量重置策略_ 。

source: If the processing throws an exception, returns a failing `Uni`, or marks the `TransactionalEmitter` for abort, the transaction is aborted.
zh_cn: 如果处理过程抛出异常，会返回失败的 `Uni`，或将 `TransactionalEmitter` 标记为中止，然后事务会被中止。

source: If the rebalance listener handles offset commit on behalf of the user (using the `NONE` commit strategy), the rebalance listener must commit the offset synchronously in the partitionsRevoked callback. We also recommend applying the same logic when the application stops.
zh_cn: 如果使用再平衡监听器代替用户来处理偏移量提交(使用 `NONE` 提交策略)，再平衡监听器就必须在partitionRevoked回调中同步提交偏移量。我们也建议在应用程序停止时使用同样的逻辑。

source: If the resolved `Map` does not contain the value the default `Map` is used (exposed with the `default-kafka-broker` name)
zh_cn: 如果 `Map` 不包含该值，则使用默认的 `Map` (通过 `default-kafka-broker` 名称暴露)

source: If the token is a JWT token then, by default, it will be verified with a `JsonWebKey` (JWK) key from a local `JsonWebKeySet` retrieved from the OpenID Connect Provider's JWK endpoint. The token's key identifier `kid` header value will be used to find the matching JWK key. If no matching `JWK` is available locally then `JsonWebKeySet` will be refreshed by fetching the current key set from the JWK endpoint. The `JsonWebKeySet` refresh can be repeated only after the `quarkus.oidc.token.forced-jwk-refresh-interval` (default is 10 minutes) expires. If no matching `JWK` is available after the refresh then the JWT token will be sent to the OpenID Connect Provider's token introspection endpoint.
zh_cn: 如果令牌是 JWT 令牌，则默认情况下，将使用从 OpenID Connect 提供程序的 JWK 端点检索到的本地 `JsonWebKeySet` 中的 `JsonWebKey`（JWK） 密钥对其进行验证。令牌的密钥标识符 `kid` 标头值( header value)将用于查找匹配的 JWK 密钥。 如果本地没有匹配的 `JWK` 可用，则 `JsonWebKeySet` 将通过从JWK端点获取当前密钥集来刷新。`JsonWebKeySet` 刷新只能在 `quarkus.oidc.token.forced-jwk-refresh-interval`（默认值为10分钟）过期后重复。 如果在刷新后没有匹配的“JWK”可用，则 JWT 令牌将发送到 OpenID Connect 提供程序的令牌自检终结点。

source: If the token is opaque (binary) then a `scope` property from the remote token introspection response will be used.
zh_cn: 如果令牌是不透明的（二进制），那么将使用来自远程令牌自省(token introspection)响应的 `scope` 属性。

source: If the token is opaque (it can be a binary token or an encrypted JWT token) then it will always be sent to the OpenID Connect Provider's token introspection endpoint.
zh_cn: 如果令牌是不透明的（可以是二进制令牌或加密的JWT令牌），那么它将总是被发送到OpenID Connect提供者的令牌自省端点。

source: If the user authentication requires Authorization Code flow or you need to support multiple tenants, use `quarkus-oidc`. `quarkus-oidc` can also request user information by using both Authorization Code Flow and Bearer access tokens.
zh_cn: 如果用户认证需要是使用Authorization Code flow或者您需要支持多租户，请使用 `quarkus-oidc` 。 `quarkus-oidc` 也可以通过Authorization Code Flow 和 Bearer access tokens来请求用户信息。

source: If the user credentials are provided by different sources, you can combine authentication mechanisms. For example, you can combine built-in `Basic` and `quarkus-oidc` `Bearer` authentication mechanisms.
zh_cn: 如果用户证书是由不同的来源提供的，您可以使用组合认证机制。例如，您可以结合内置的 `Basic` 和 `quarkus-oidc` `Bearer` 认证机制。

source: If there are any problems creating the function, you must delete it with the `delete` function before re-running the `create` command.
zh_cn: 如果在创建函数时有任何问题，你必须在重新运行 `create` 命令之前使用 `delete` 函数来删除它。

source: If there is an immediate need for a test to define Wiremock stubs not currently supported by `OidcWiremockTestResource` one can do so via a `WireMockServer` instance injected into the test class, for example:
zh_cn: 如果一个测试需要立即定义Wiremock存根(stubs)，而目前 `OidcWiremockTestResource` 不支持，可以通过注入测试类的 `WireMockServer` 实例来实现，例如:

source: If this is the only key property which is set then the incoming token is expected to contain the encrypted claims only. If either `mp.jwt.verify.publickey` or `mp.jwt.verify.publickey.location` verification properties are also set then the incoming token is expected to contain the encrypted inner-signed token.
zh_cn: 如果这是唯一被设置的密钥属性，那么传入的令牌预计将只包含加密的claims。如果 `mp.jwt.verify.publickey` 或 `mp.jwt.verify.publickey.location` 验证属性也被设置，那么传入的令牌预计将包含加密的内签令牌。

source: If this property is enabled then a signed token must contain either 'x5t' or 'x5t#S256' X509Certificate thumbprint headers. Verification keys can only be in JWK or PEM Certificate key formats in this case. JWK keys must have a 'x5c' (Base64-encoded X509Certificate) property set.
zh_cn: 如果此属性被启用，那么签名的令牌必须包含 `x5t` 或 `x5t#S256` X509Certificate的thumbprint headers。在这种情况下，验证密钥只能是JWK或PEM证书密钥格式。JWK密钥必须有一个 `x5c`（Base64编码的X509Certificate）属性设置。

source: If using Gradle, the path to the binaries in the YAML templates must be changed from `target` to `build`
zh_cn: 如果使用Gradle，YAML模板中的二进制文件的路径必须从 `target` 改为 `build`

source: If using Gradle, the path to the binaries in the `manage.sh` must be changed from `target` to `build`
zh_cn: 如果使用Gradle， `manage.sh` 中二进制文件的路径必须从 `target` 变为 `build`

source: If using Powershell , wrap `-D` parameters in double quotes e.g. `"-DprojectArtifactId=getting-started"`
zh_cn: 如果使用Powershell，用双引号包住 `-D` 参数，例如： `"-DprojectArtifactId=getting-started"`

source: If using cmd , (don't use backward slash `\` and put everything on the same line)
zh_cn: 如果使用cmd ，（不要使用反斜线 `\` ，并将所有内容放在同一行）

source: If we focus on the dependencies section, you can see the extension allowing the development of REST applications:
zh_cn: 如果我们把重点放在依赖关系部分，你可以看到允许开发REST应用程序的扩展：

source: If we then apply this annotation to a test class it will act as if we had applied both the `@QuarkusTest` and `@Transactional` annotations, e.g.:
zh_cn: 如果我们将这个注解应用于测试类，那它就类似于我们同时应用了 `@QuarkusTest` 和 `@Transactional` 注解一样，例如：

source: If we were to use the code above, we would get an exception like the following when using the native executable:
zh_cn: 如果我们使用上面的代码，在使用本地可执行文件时，我们会得到一个类似下面的异常：

source: If you already have your Quarkus project configured, you can add the `micrometer-registry-prometheus` extension to your project by running the following command in your project base directory:
zh_cn: 如果您已有配置好的Quarkus项目，您可以通过在您的项目根目录下运行以下命令来将 `micrometer-registry-prometheus` 扩展添加到您的项目中：

source: If you already have your Quarkus project configured, you can add the `mongodb-client` extension to your project by running the following command in your project base directory:
zh_cn: 如果你已经配置了你的Quarkus项目，你可以通过在你的项目基础目录下运行以下命令，将 `mongodb-client` 扩展添加到你的项目中：

source: If you already have your Quarkus project configured, you can add the `oidc` and `keycloak-authorization` extensions to your project by running the following command in your project base directory:
zh_cn: 如果您已经配置了Quarkus项目，您可以通过在项目根目录中执行以下命令将 `oidc` 和 `keycloak-authorization` 扩展添加到您的项目中:

source: If you already have your Quarkus project configured, you can add the `oidc` extension to your project by running the following command in your project base directory:
zh_cn: 如果你已经配置了你的Quarkus项目，你可以通过在你的项目基础目录下运行以下命令，将 `oidc` 扩展加入到你的项目中去：

source: If you already have your Quarkus project configured, you can add the `quarkus-opentelemetry-exporter-otlp` extension to your project by running the following command in your project base directory:
zh_cn: 如果您已经配置了您的Quarkus项目，您可以通过在您的项目根目录下运行以下命令，将 `quarkus-opentelemetry-exporter-otlp` 扩展添加到您的项目中：

source: If you already have your Quarkus project configured, you can add the `redis-client` extension to your project by running the following command in your project base directory:
zh_cn: 如果你已经配置了Quarkus项目，可以通过在项目根目录下运行以下命令，将 `redis-client` 扩展添加到你的项目：

source: If you already have your Quarkus project configured, you can add the `smallrye-jwt` extension to your project by running the following command in your project base directory:
zh_cn: 如果你已经配置了你的Quarkus项目，你可以通过在你的项目基础目录下运行以下命令，将 `smallrye-jwt` 扩展到你的项目。

source: If you already have your Quarkus project configured, you can add the `spring-boot-properties` extension to your project by running the following command in your project base directory:
zh_cn: 如果你已经配置了你的Quarkus项目，你可以在项目的根目录下运行以下命令，并将 `spring-boot-properties` 扩展添加到你的项目中:

source: If you already have your Quarkus project configured, you can add the `spring-cloud-config-client` extension to your project by running the following command in your project base directory:
zh_cn: 如果你已经配置了你的Quarkus项目，你可以通过在你的项目根目录下运行以下命令，将 `spring-cloud-config-client` 扩展添加到你的项目中:

source: If you already have your Quarkus project configured, you can add the `spring-scheduled` extension to your project by running the following command in your project base directory:
zh_cn: 如果你已经配置了你的Quarkus项目，你可以在你的项目根目录下运行以下命令，将 `spring-scheduled` 扩展添加到你的项目中:

source: If you are a Java EE or Spring user, this development model should look familiar. You expose a resource containing methods annotated with <code>@GET</code>, <code>@POST</code>…&ZeroWidthSpace;&ZeroWidthSpace; to handle the different requests. The path is specified using the <code>@Path</code> annotation. Quarkus also supports <a href="https://quarkus.io/guides/spring-web">Spring controller</a> annotations such as <code>@GetMapping</code> or <code>@RestController</code>.
zh_cn: 如果你是一个Java EE或Spring的用户，这个开发模型应该看起来很熟悉。你暴露一个资源，其中包含有<code>@GET</code>, <code>@POST</code>...&ZeroWidthSpace;&ZeroWidthSpace; 注释的方法来处理不同的请求。路径是使用<code>@Path</code>注解指定的。Quarkus还支持<a href="https://quarkus.io/guides/spring-web">Spring控制器</a>注释，如<code>@GetMapping</code>或<code>@RestController</code>。

source: If you are already familiar with Keycloak, you’ll notice that the extension is basically another adapter implementation but specific for Quarkus applications. Otherwise, you can find more information in the Keycloak https://www.keycloak.org/docs/latest/authorization_services/index.html#_enforcer_overview[documentation].
zh_cn: 如果您已经熟悉Keycloak，您会注意到这个扩展基本上是另一个专门针对Quarkus的keycloak适配器的实现。另外，您也可以在Keycloak link:https://www.keycloak.org/docs/latest/authorization_services/index.html#_enforcer_overview[文档] 中找到更多信息。

source: If you are an extension developer or want to contribute to Quarkus development, join our mailing list either <a href="mailto:quarkus-dev+subscribe@googlegroups.com">emailing us</a> or by visiting our <a href="https://groups.google.com/d/forum/quarkus-dev">Google Groups page</a>. Make sure you visit our extensive <a href="{{site.baseurl}}/guides/writing-extensions">Writing extensions guide</a>.
zh_cn: 如果你是一个扩展程序的开发者，或者想为Quarkus的发展做出贡献，请加入我们的邮件列表，可以<a href="mailto:quarkus-dev+subscribe@googlegroups.com">给我们写信</a>，或者访问我们的<a href="https://groups.google.com/d/forum/quarkus-dev">Google Groups页面</a>。请务必访问我们广泛的<a href="{{site.baseurl}}/guides/writing-extensions">写作扩展指南</a>。

source: If you are building native images, and want to use https://aws.amazon.com/xray[AWS X-Ray Tracing] with your lambda you will need to include `quarkus-amazon-lambda-xray` as a dependency in your pom. The AWS X-Ray library is not fully compatible with GraalVM so we had to do some integration work to make this work.
zh_cn: 如果你正在构建原生镜像，并希望在你的lambda中使用 link:https://aws.amazon.com/xray[AWS X-Ray Tracing] ，那么你将需要在你的pom中包含 `quarkus-amazon-lambda-xray` 来作为一个依赖项。AWS X-Ray库与GraalVM并不完全兼容，因此我们不得不做一些整合工作来使其正常运行。

source: If you are building native images, and want to use https://aws.amazon.com/xray[AWS X-Ray Tracing] with your lambda you will need to include `quarkus-amazon-lambda-xray` as a dependency in your pom. The AWS X-Ray library is not fully compatible with GraalVM, so we had to do some integration work to make this work.
zh_cn: 如果你正在构建原生镜像，并希望在你的lambda中使用 link:https://aws.amazon.com/xray[AWS X-Ray 追踪] ，你将需要在你的pom中把 `quarkus-amazon-lambda-xray` 作为一个依赖项来包括。AWS X-Ray库与GraalVM并不完全兼容，因此我们不得不做一些整合工作来使其可以正常工作。

source: If you are building on a non-Linux system, you will need to also pass in a property instructing Quarkus to use a docker build as Amazon Lambda requires linux binaries. You can do this by passing this property to your build: `-Dquarkus.native.container-build=true`. This requires you to have Docker installed locally, however.
zh_cn: 如果你在非Linux系统上构建，你还需要传入一个属性，指示Quarkus使用docker构建，因为Amazon Lambda需要linux二进制文件。你可以通过向你的构建传递这个属性来实现： `-Dquarkus.native.container-build=true` 。不过，这需要你在本地安装了Docker。

source: If you are building on a non-Linux system, you will need to also pass in a property instructing quarkus to use a Docker build as Amazon Lambda requires Linux binaries. You can do this by passing `-Dquarkus.native.container-build=true` to your build command. This requires you to have Docker installed locally, however.
zh_cn: 如果你在非Linux系统上进行构建，你还需要传入一个属性，指示quarkus使用Docker构建，因为Amazon Lambda需要Linux二进制文件。你可以通过将 `-Dquarkus.native.container-build=true` 传给你的构建命令来实现。不过，这需要你在本地安装了Docker。

source: If you are looking for small container images, the https://github.com/GoogleContainerTools/distroless[distroless] approach reduces the size of the base layer. The idea behind _distroless_ is the usage of a single and minimal base image containing all the requirements, and sometimes even the application itself.
zh_cn: 如果你正在寻找小型的容器镜像，https://github.com/GoogleContainerTools/distroless[无发行] 的方法可以减少基础层的大小。 _distroless_ 背后的想法是使用一个单一和最小的基础镜像包含所有的需求，有时甚至是应用程序本身。

source: If you are not familiar with Mutiny, check xref:mutiny-primer.adoc[Mutiny - an intuitive reactive programming library].
zh_cn: 如果你不熟悉Mutiny，请查看 link:mutiny-primer.html[Mutiny - 一个直观的响应式编程库] 。

source: If you are running on a Windows machine, please keep in mind that the binary was created within a Linux docker container. Hence, the binary will not be executable on the host Windows machine.
zh_cn: 如果你是在Windows机器上运行，请记住，二进制文件是在Linux docker容器中创建的。因此，二进制文件在Windows主机上是无法执行的。

source: If you are testing your application with `sam local` you can hardcode a principal name to use when your application runs by setting the `QUARKUS_AWS_LAMBDA_FORCE_USER_NAME` environment variable
zh_cn: 如果你使用 `sam local` 测试你的应用程序，你可以通过设置 `QUARKUS_AWS_LAMBDA_FORCE_USER_NAME` 环境变量来硬编码一个主体名，以便在应用程序运行时使用

source: If you are using <<kafka-dev-services>>, a Kafka broker will be started and available throughout the tests, unless it is disabled in `%test` profile. While it is possible to connect to this broker using Kafka Clients API, https://smallrye.io/smallrye-reactive-messaging/latest/kafka/test-companion/[Kafka Companion Library] proposes an easier way of interacting with a Kafka broker and, creating consumer, producer and admin actions inside tests.
zh_cn: 如果您使用 link:#kafka-dev-services[[kafka-dev-services]] ，Kafka broker将被启动并在整个测试中可用，除非它在 `%test` profile中被禁用。虽然可以使用Kafka客户端API连接到这个broker，但 link:https://smallrye.io/smallrye-reactive-messaging/latest/kafka/test-companion/[Kafka Companion Library] 提出了一种更简单的方式来与Kafka broker通信，并在测试中创建消费者、生产者和管理操作。

source: If you are using Gradle in your project, you can use this sample Dockerfile. Save it in `src/main/docker/Dockerfile.multistage`.
zh_cn: 如果在项目中使用Gradle，你可以使用这个Docker文件例子。将其保存在 `src/main/docker/Dockerfile.multistage` 。

source: If you are using Quarkus Security, check out the xref:security-testing.adoc[Testing Security] section for information on how to easily test security features of the application.
zh_cn: 如果您正在使用Quarkus Security，请查看 link:security-testing.html[测试安全] 部分，了解如何轻松测试应用程序的安全功能。

source: If you are using RESTEasy Reactive and JAX-RS, you can inject various AWS Context variables into your JAX-RS resource classes using the JAX-RS `@Context` annotation or anywhere else with the CDI `@Inject` annotation.
zh_cn: 如果您使用RESTEasy Reactive和JAX-RS，您可以使用JAX-RS `@Context` 注解将各种AWS上下文变量注入到JAX-RS资源类中，或者注入到带有CDI `@Inject` 注解的任何其他地方。

source: If you are using a Docker image to build, then you must extract these files from this image.
zh_cn: 如果你使用Docker镜像来进行构建，那么你必须从这个镜像中提取这些文件。

source: If you are using dependencies that require logging components such as Apache Commons Logging or Log4j and are experiencing a `ClassNotFoundException` when building the native executable, you can resolve this by excluding the logging library and adding the corresponding JBoss Logging adapter.
zh_cn: 如果你的应用需要依赖日志组件（如Apache Commons logging或Log4j），并且在构建原生可执行文件时遇到了' ClassNotFoundException '，你可以通过排除日志库并添加相应的JBoss日志适配器来解决这个问题。

source: If you are using the `quarkus-hibernate-orm-panache` or `quarkus-mongodb-panache` extensions, check out the xref:hibernate-orm-panache.adoc#mocking[Hibernate ORM with Panache Mocking] and xref:mongodb-panache.adoc#mocking[MongoDB with Panache Mocking] documentation for the easiest way to mock your data access.
zh_cn: 如果您使用 `quarkus-hibernate-orm-panache` 或 `quarkus-mongodb-panache` 扩展，请查看 link:hibernate-orm-panache.html#mocking[Hibernate ORM with Panache Mocking] 和 link:mongodb-panache.html#mocking[MongoDB with Panache Mocking] 文档，以了解mock数据访问的最简单方式。

source: If you are using the `quarkus-micrometer` or `quarkus-smallrye-metrics` extension, `quarkus-mongodb-client` can provide metrics about the connection pools. This behavior must first be enabled by setting the `quarkus.mongodb.metrics.enabled` property to `true` in your `application.properties`.
zh_cn: 如果你使用 `quarkus-micrometer` 或 `quarkus-smallrye-metrics` 扩展， `quarkus-mongodb-client` 可以提供关于连接池的指标。这种行为必须首先通过在你的 `application.properties` 中设置 `quarkus.mongodb.metrics.enabled` 属性为 `true` 来启用。

source: If you are using the `quarkus-smallrye-health` extension, `quarkus-mongodb-client` will automatically add a readiness health check to validate the connection to the cluster.
zh_cn: 如果你使用 `quarkus-smallrye-health` 扩展， `quarkus-mongodb-client` 将自动添加就绪状态检查，以验证与集群的连接。

source: If you are using the `quarkus-smallrye-health` extension, `quarkus-vertx-redis` will automatically add a readiness health check to validate the connection to the Redis server.
zh_cn: 如果你使用了 `quarkus-smallrye-health` 扩展， `quarkus-vertx-redis` 将自动添加就绪健康检查，以验证与Redis服务的连接。

source: If you are using the `quarkus-smallrye-opentracing` extension, `quarkus-mongodb-client` can register traces about the commands executed. This behavior must be enabled by setting the `quarkus.mongodb.tracing.enabled` property to `true` in your `application.properties` and adding the dependency `io.opentracing.contrib:opentracing-mongo-common` to your pom.xml (for more info read the xref:opentracing.adoc#mongodb-client[OpenTracing - MongoDB client] section).
zh_cn: 如果你使用 `quarkus-smallrye-opentracing` 扩展， `quarkus-mongodb-client` 可以注册关于所执行命令的跟踪。必须通过在你的 `application.properties` 中将 `quarkus.mongodb.tracing.enabled` 属性设置为 `true` 并在你的 pom.xml 中添加依赖性 `io.opentracing.contrib:opentracing-mongo-common` 来启用这一行为（更多信息请阅读 link:opentracing.html#mongodb-client[OpenTracing - MongoDB 客户端] 部分）。

source: If you are using the active record pattern you cannot use Mockito directly as it does not support mocking static methods, but you can use the `quarkus-panache-mock` module which allows you to use Mockito to mock all provided static methods, including your own.
zh_cn: 如果你使用了Active Record模式，那么不能直接使用Mockito，因为它不支持Mock静态方法。你可以使用 `quarkus-panache-mock` 模块，它允许你使用Mockito来模拟所有静态方法，包括你自己编写的。

source: If you are using the active-record pattern you cannot use Mockito directly as it does not support mocking static methods, but you can use the `quarkus-panache-mock` module which allows you to use Mockito to mock all provided static methods, including your own.
zh_cn: 如果你使用active-record模式，你不能直接使用Mockito，因为它不支持模拟静态方法，但你可以使用 `quarkus-panache-mock` 模块，它允许你使用Mockito来模拟所有提供的静态方法，包括你自己的。

source: If you are using the repository pattern you can use Mockito directly, using the `quarkus-junit5-mockito` module, which makes mocking beans much easier:
zh_cn: 如果你使用存储库模式，你可以直接使用Mockito，使用 `quarkus-junit5-mockito` 模块，这使得模拟Bean变得更加容易：

source: If you are working with your native image build, simply replace the template name with the native version:
zh_cn: 如果你正在使用原生镜像构建，只需将模板名称替换为原生版本：

source: If you aren't using Prometheus, you have a few options. Some Micrometer registry implementations have been wrapped in https://github.com/quarkiverse/quarkiverse-micrometer-registry[Quarkiverse extensions]. To use the Micrometer StackDriver MeterRegistry, for example, you would use the `quarkus-micrometer-registry-stackdriver` extension:
zh_cn: 如果您不使用Prometheus，您可以有其他选择。一些Micrometer registry的实现已经包含在 link:https://github.com/quarkiverse/quarkiverse-micrometer-registry[Quarkiverse扩展] 中了。例如，要使用Micrometer StackDriver MeterRegistry，您可以使用 `quarkus-micrometer-registry-stackdriver` 扩展：

source: If you cannot install GraalVM, you can use a multi-stage Docker build to run Maven inside a Docker container that embeds GraalVM. There is an explanation of how to do this at the end of this guide.
zh_cn: 如果你无法安装GraalVM，你可以使用多阶段Docker构建在嵌入GraalVM的Docker容器内运行Maven。本指南最后有关于如何操作的解释。

source: If you configure `mp.jwt.verify.publickey.location` to point to HTTPS or HTTP based JsonWebKey (JWK) set then you can use the same approach as described in the xref:security-openid-connect.adoc#integration-testing[OpenID Connect Bearer Token Integration testing] `Wiremock` section but only change the `application.properties` to use MP JWT configuration properties instead:
zh_cn: 如果你配置 `mp.jwt.verify.publickey.location` ，以指向HTTPS或基于HTTP的JsonWebKey（JWK）集，那么你可以使用与 link:security-openid-connect.html#integration-testing[OpenID Connect Bearer Token集成测试] `Wiremock` 部分所述相同的方法，但只需改变 `application.properties` ，以使用MP JWT配置属性来代替：

source: If you did not leave Quarkus running in dev mode, start it again:
zh_cn: 如果您的Quarkus从之前的开发模式下退出了，那么请再次启动它：
